Revit 2023 API
ExternalDefinition.ParameterGroup Property
 Returns the group ID of the parameter definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public override BuiltInParameterGroup ParameterGroup { get; }
Visual Basic
Public Overrides ReadOnly Property ParameterGroup As BuiltInParameterGroup
	Get
Visual C++
public:
virtual property BuiltInParameterGroup ParameterGroup {
	BuiltInParameterGroup get () override;
}
See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace